win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
/* Microchip ZigBee2006 Residential Stack
 * Demo Router
 *
 *******************************************************************************
 * FileName:        Router.c
 * Date modified:   02/10/2013
 *
 * Microcontroller: PIC24FJ128GA306
 * Transceiver:     Microchip MRF24J40
 *
 * Editor:          MPLAB X IDE v1.50
 * Complier:        MCC30 v3.31
 *
 * Developer:       Nguyen Tien Dat
 * Class:           KSTN - DTVT - K54
 * Group:           WSAN
 * Organization:    Lab411 - Hanoi University of Technology
 *
 * Description:     Chuong trinh nay thuc hien setup mot thiet bi tro thanh mot
 *                  node mang dong vai tro la mot Zigbee Router. Chuong trinh
 *                  cung duoc thiet ke de tuong tac voi cac thiet bi khac trong
 *                  mang theo chuan Zigbee (Zigbee Router hoac Zigbee End Device).
 *                  Cac hoat dong do bao gom: cho phep gia nhap/khong gia nhap
 *                  mang, yeu cau ban tin tu mot thiet bi hoac mot nhom thiet bi
 *                  trong mang, gui ban tin toi mot thiet bi hoac mot nhom cac
 *                  thiet bi trong mang.
 *
 * Note:            Xem lich su ma nguon trong file Readme.txt
*******************************************************************************/
//******************************************************************************
// Header Files
//******************************************************************************
// Include the main ZigBee header file.
#include "zAPL.h"
#include "zNVM.h"
#include "zPHY_MRF24J40.h"
#ifdef I_SUPPORT_SECURITY
    #include "zSecurity.h"
#endif

// If you are going to use UART module(s), include this file.
#if defined(USE_DEBUG) || defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
    #include "console.h"
#endif

// If you are going to use SHT module, include this file.
#if defined(USE_SHT10)
    #include "delay.h"
    #include "SHT1x.h"
#endif

//******************************************************************************
// Configuration Bits
//******************************************************************************
#if defined(__PIC24F__)
    // Configure by dat_a3cbq91
    _CONFIG1(JTAGEN_OFF & GCP_OFF & GWRP_OFF & LPCFG_OFF & ICS_PGx1 & WINDIS_OFF
                                    & FWDTEN_WDT_SW &  FWPSA_PR128 & WDTPS_PS512);
    _CONFIG2(IESO_ON & FNOSC_FRC & FCKSM_CSECME & OSCIOFCN_OFF & IOL1WAY_OFF & POSCMD_HS);
    _CONFIG3(BOREN_ON);
    // End by dat_a3cbq91
#elif defined(__dsPIC33F__) || defined(__PIC24H__)
    // Explorer 16 board
    _FOSCSEL(FNOSC_PRI)			// primary osc
    _FOSC(OSCIOFNC_OFF & POSCMD_XT)	// XT Osc
    _FWDT(FWDTEN_OFF)			// Disable Watchdog timer
    // JTAG should be disabled as well
#elif defined(__dsPIC30F__)
    // dsPICDEM 1.1 board
    _FOSC(XT_PLL16)		// XT Osc + 16X PLL
    _FWDT(WDT_OFF)		// Disable Watchdog timer
    _FBORPOR(MCLR_EN & PBOR_OFF & PWRT_OFF)
#else
    #error Other compilers are not yet supported.
#endif

//******************************************************************************
// Constants                        //defined application service   @dat_a3cbq91
//******************************************************************************
//Define for useful constants
#define SET             1
#define SaveEnergyMode  1

#define CLEAR           0
#define ActiveMode      0

//Define registers of MCU to control Leds
#if defined(USE_LED)
    #if defined(CHAMSOCLAN) || defined(THEODOIDONGVAT)
        #define WSAN_LED_TRIS 		TRISFbits.TRISF3
        #define WSAN_LED 		LATFbits.LATF3
    #endif

    #if defined(CANHBAOCHAYRUNG)
        #define WSAN_LED_TRIS           TRISEbits.TRISE4
        #define WSAN_LED                LATEbits.LATE4
    #endif

    //parameter of speed blink led
    #define BLINK_LED_JOIN              4000
    #define BLINK_LED_NOT_JOIN          300
#endif

//In warning-low-power application
#if defined(USE_WARNING_LOW_POWER)
    //Define registers of MCU to control pins
    #define VOLTAGE_MEASURE_TRIS            TRISBbits.TRISB8
    #define VOLTAGE_MEASURE_ANALOG          ANSBbits.ANSB8
    #define SUPPLY_VOLT_ZENER_TRIS          TRISBbits.TRISB10
    #define SUPPLY_VOLT_ZENER               LATBbits.LATB10

    // trang thai: 0x03 --> muc nang luong co dau hieu can kiet
    #define LowPower                        0x03
    // Gia tri nguong canh bao het nang luong: 2,4V @ADC 12 bits
    #define ThresholdPower                  1350
    // So lan gui canh bao ve bo nhung truoc khi dung hoat dong cua khoi ADC
    #define MaxNumberWarningLowPower        2
    // Kenh ADC do dien ap nguon la AN8
    #define VOLTAGE_MEASURE_CHANNEL         0x0008
    // Buffer luu ket qua chuyen doi tuong tu-so dien ap nguon
    #define POWER_SUPPLY_BUFF               ADC1BUF8
#endif

#if defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)
    // Gia tri cho biet module ADC dang do tin hieu tu cam bien khoi hay tu nguon cap
    #define Power_Mode_ADC  0b00
    #define MQ6_Mode_ADC    0b01
    #define Finish_Convert  0b10
#endif

//In warning-fire-forest application
#if defined(USE_MQ6_V1)
    //Define registers of MCU to control pins
    #define MQ6_MEASURE_TRIS                TRISBbits.TRISB1
    #define MQ6_MEASURE_ANALOG              ANSBbits.ANSB1

    // trang thai: 0x02 --> phat hien co khoi
    #define DetectingSmoke          0x02
    // Kenh ADC do dien ap tin hieu MQ6 la AN1
    #define MQ6_MEASURE_CHANNEL     0x0001
    // Buffer luu ket qua chuyen doi tuong tu-so dien ap tin hieu MQ6
    #define MQ6_BUFF                ADC1BUF1
#endif

#if defined(USE_MQ6_V2)
    // trang thai: 0x02 --> phat hien co khoi
    #define DetectingSmoke          0x02
    #define BlockMaxMQ6             12
#endif

#if defined(USE_MINI_RADAR_V2)
    // 0x04 --> phat hien co doi tuong dang xam nhap bang cam bien MW
    #define DetectingByMicroWave    0x04

    #define MaxCount                3
    //#define MaxCount                40
    #define BlockMaxRadar           3
#endif

#if defined(USE_PIR)
    // 0x05 --> phat hien co doi tuong dang xam nhap bang cam bien PIR
    #define DetectingByPIR          0x05
#endif

