win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
//******************************************************************************
// Function Prototypes
//******************************************************************************
//functions that have been created and modified by dat_a3cbq91
void HardwareInit( void );
void ProcessNONZigBeeTasks(void);
void ProcessZigBeePrimitives(void);

//Node mang su dung ham SenOneByte de gui ban tin toi Router-EMB (NetAddr = 0x0001)
void SendOneByte(BYTE data, WORD ClusterID);

#if defined(USE_SHT10)
    //Node mang gan sensor SHT su dung ham nay de gui du lieu ve Router-EMB
    void Send_HTE_ToRouterEmboard(WORD HTE_Cluster);

    //Node mang gan sensor SHT su dung ham nay de lay du lieu tu sensorSHT
    void LoadSHT10(void);
#endif
//end by dat_a3cbq91

//created by Hoang Anh Son
#if defined (TRACE_ROUTE_SUPPORT)
    void SendRoutingTableToRouterEMB(void);
    void RouteDrawRequestToNextHop(BYTE MSB_dest_addr, BYTE LSB_dest_addr, BYTE NodeNumber, BYTE *pListOfNode);
    void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode);
    //danglam
#endif
//end by Hoang Anh Son

extern void RemoveAllGroups(void);
extern BOOL LookupAPSAddress(LONG_ADDR *);
#if defined(I_SUPPORT_BINDINGS)
    extern void RemoveAllBindings(SHORT_ADDR);
#endif

//******************************************************************************
// Application Variables
//******************************************************************************
NETWORK_DESCRIPTOR  *currentNetworkDescriptor;
NETWORK_DESCRIPTOR  *NetworkDescriptor;
ZIGBEE_PRIMITIVE    currentPrimitive;
BYTE                orphanTries;
#ifdef I_SUPPORT_SECURITY
    extern KEY_VAL	KeyVal;
    #ifdef USE_EXTERNAL_NVM
        extern WORD trustCenterLongAddr;
        extern NETWORK_KEY_INFO plainSecurityKey[2];
    #else
        extern ROM LONG_ADDR trustCenterLongAddr;
    #endif
#endif

BYTE AllowJoin = SET;
extern NWK_STATUS nwkStatus;

//variables has modified by dat_a3cbq91
#if defined(USE_LED)
    WORD Led_Count = BLINK_LED_NOT_JOIN;
#endif

#if defined(USE_WARNING_LOW_POWER)
    WORD Energy_Level;//Luu tru ket qua do dien ap nguon @dat_a3cbq91
    BYTE NumberOfWarning = MaxNumberWarningLowPower;//So lan gui ban tin canh bao het nang luong, mac dinh la 2 lan.
#endif

#if defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)
    WORD ADC_result;//Luu tru gia tri lay mau tu ADC module @dat_a3cbq91
#endif

#if defined(USE_MQ6_V1)
    WORD Mq6Signal;//Luu tru ket qua do tin hieu tu cam bien khoi MQ6 @dat_a3cbq91
    WORD ThresholdMQ6;//Bien nay cho phep tuy chinh nguong bao chay thong qua bo nhung
    WORD Threshold_0;//Bien luu gia tri nguong ban dau tuy thuoc vao moi truong

    BYTE k = 8;//bien nay duoc su dung de dem so lan do MQ6 tai moi thoi diem, mac dinh la 8 lan
#endif

#if defined(USE_MQ6_V2)
    BYTE TimeBlockMQ6 = BlockMaxMQ6;
#endif

#if defined(USE_MINI_RADAR_V2)
    BYTE count = 0;
    BYTE TimeBlockMiniRadar = BlockMaxRadar;
    DWORD CountLoop = 0, past_count = 0, diff;
#endif

#if defined(USE_MINI_RADAR_V3)
    DWORD past_ICtimer, present_ICtimer, diff;
    BYTE count = 0;
#endif

#if defined(USE_SHT10)
    WORD humidity, temperature;//Luu tru gia tri do am, nhiet do lay tu SHT chua qua xu ly @dat_a3cbq91
#endif
    
#if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
    volatile BYTE StatusActor;//bien nay dung de nhan thong tin phan hoi tu mach dieu khien may bom.
                             //No cung chinh la du lieu se duoc gui toi bo nhung de xac nhan ket qua cua lenh dieu khien
#endif

//for sleep mode @by Hoang Anh Son
#if defined(USE_SAVE_ENERGY_MODE)
    //Cac tham so duoi day dung timer duoc dinh nghia theo TIMER_UNIT
    BYTE SLEEP_DURATION  = 20 * ONE_MINUTE_VALUE;
    BYTE WAKE_DURATION = ONE_MINUTE_VALUE;
    BYTE confirmCmd, pre_confirmCmd;
    BYTE SleepingState = CLEAR;
    BYTE WakingState = CLEAR;
    BYTE SleepingStateTimerFlag = CLEAR;
    BYTE SendDataAfterSleep = CLEAR;
    void MCUSleep(void);
    void MCUWake(void);
#endif

//variable store state of device
#if defined(CHAMSOCLAN)
static union
{
    struct
    {
        WORD EnableGetDataHTE       : 1;//when timer complete, this flag is set to get humi - temp data from SHT sensor
        WORD HTE_Data_Ready         : 1;//when finished getting humi - temp data, this flag is set to be able to send data to RE.
        WORD ActorAckReceive        : 1;//when receive confirm from control pump board, this flag is set to be able to send response to RE.

        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD CompleteADC            : 1;//this flag use to identify that conversion of MQ6 signal and voltage signal are completed

        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.

        WORD EnablePingToRE         : 1;//this flag use to inform to RE that ACTOR 1 or ACTOR2 is existing
        WORD PrintNeighborTable     : 1;

        WORD Reservation            : 8;
    } bits;
    WORD Val;
} WSANFlags;
#elif defined(CANHBAOCHAYRUNG)
static union
{
    struct
    {
        WORD EnableGetDataHTE       : 1;//when timer complete, this flag is set to get humi - temp data from SHT sensor
        WORD HTE_Data_Ready         : 1;//when finished getting humi - temp data, this flag is set to be able to send data to RE.
        WORD ActorAckReceive        : 1;//when receive confirm from fire-waring board, this flag is set to be able to send response to RE.

        WORD PrintNeighborTable     : 1;

        WORD OnTimeGetMQ6           : 1;//when system stability (5 min after start up), this device receive signal from MQ6
        WORD DisableGetThresMq6     : 1;//when complete getting threshold of warning fire, this flag is set
        WORD MQ6Warning             : 1;//when MQ6 detect smoke, this flag is set to be able to send warning to RE
        WORD DisableSendingMsg      : 1;//when device send a message warning fire forest, this flag will be set to suspend
        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD MQ6orVoltage           : 2;//this flag use to identify what signal is convert to digital
                                        //when we need to use both MQ6 sensor and monitor energy level
        WORD CompleteADC            : 1;//this flag use to identify that conversion of MQ6 signal and voltage signal are completed

