win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.

        WORD EnablePingToRE         : 1;//this flag use to inform to RE that ACTOR2 is existing

        WORD Reservation            : 2;
    } bits;
    WORD Val;
} WSANFlags;
#else
static union
{
    struct
    {
        WORD PrintNeighborTable     : 1;

        WORD MicrowaveDetecting     : 1;//when sensor Microwave detect something, this flag is set to be able to send warning to RE.
        WORD PIRDetecting           : 1;//when sensor PIR detect something, this flag is set to be able to send warning to RE.

        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD CompleteADC            : 1;//this flag use to identify that conversion of voltage supply signal are completed

        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.

        WORD EnableReceiveMW        : 1;//this flag use to enable receive warning from Miniradar, after the node join to Zigbee network.
        WORD EnableReceivePIR       : 1;//this flag use to enable receive warning from PIR, after the node join to Zigbee network.
        WORD BlockMiniradarV2       : 1;//this flag use to block interrupt signal from miniradar after warning in nearly 15s

        WORD Reservation            : 7;
    } bits;
    WORD Val;
} WSANFlags;
#endif

//Other variable
BYTE i;//bien i su dung nhu mot bien tam trong cac vong lap
/*
 * Bien nay cho phep tuy chinh chu ki gui thong tin xac nhan cua actor2 ve
 * Router-Emboar. Mac dinh la 20 phut gui mot lan.
 * Ngoai ra, bien nay cho phep tuy chinh chu ki gui du lieu nhiet do - do am ve
 * Router-EMB thong qua bo nhung khi nut mang o che do active. Mac dinh la 20
 * phut gui mot lan o che do active.
 */
WORD CYCLE_SENDING;
WORD TimerCount = 0;//bien dem so lan ngat Timer
DWORD timer = TIMER_UNIT;//every 5s, the timer32 bit interrupt again.
//end by dat_a3cbq91

//******************************************************************************
//******************************************************************************
//******************************************************************************
int main(void)
{
    /*******************************create by lab411****************************/
    OSCCON = 0x2001;//current osc HS, new osc FRC

    CLKDIV = 0x0000;//Fcy = Fosc/2

    /************Maping Pins************/
    //unlock registers
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bclr OSCCON, #6");

    // INT1 >>> RP21
    RPINR0bits.INT1R = 21;

    /*------SPI1------*/
    // SCK1 >> RP26
    RPINR20bits.SCK1R = 26;
    RPOR13bits.RP26R  = 8;
    // SDO1 >> RP19
    RPOR9bits.RP19R   = 7;
    // SDI1 >> RP27
    RPINR20bits.SDI1R = 27;

    /*------SPI2------*/
    // SCK2 >> RP3
    RPINR22bits.SCK2R = 3;
    RPOR1bits.RP3R    = 11;
    //SDO2 >> RP2
    RPOR1bits.RP2R    = 10;
    // SDI2 >> RP4
    RPINR22bits.SDI2R = 4;

    /*------UART1-----*/
    // RX1 >> RP22
    RPINR18bits.U1RXR = 22;
    // TX1 >> RP25
    RPOR12bits.RP25R  = 3;

    /*------UART2-----*/
    // RX2 >> RP24
    RPINR19bits.U2RXR = 24;
    // TX2 >> RP23
    RPOR11bits.RP23R  = 5;

//    /*---INPUT CAPTURE---*/
//    // IC1 >> RP22
//    RPINR7bits.IC1R = 22;

    //lock register
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bset OSCCON, #6");
    /*********************************end by lab411*****************************/
    CLRWDT();
    ENABLE_WDT();

    NetworkDescriptor = NULL;
    orphanTries = 3;

    CYCLE_SENDING = 5 * ONE_MINUTE_VALUE;//default cycle
//    CYCLE_SENDING = 6 * FIVE_SECONDS;//cycle: 30s

    // If you are going to send data to a terminal, initialize module UART2.
    // Initialize module UART2 to communicate with Control Pump board.
    #if defined(USE_DEBUG) || defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
	ConsoleInit();
    #endif

    #if defined(USE_DEBUG)
        printf("Init UART2\r\n");
    #endif

    // Initialize the hardware - must be done before initializing ZigBee.
    HardwareInit();
    
    #if defined(USE_DEBUG)
        printf("Init Hardware\r\n");
    #endif

    /* Initialize my status flags*/
    WSANFlags.Val = 0x0000;

    // Initialize the ZigBee Stack.
    ZigBeeInit();
    currentPrimitive = NO_PRIMITIVE;
    #if defined(USE_DEBUG)
        printf("Zigbee Init\r\n");
    #endif

    // *************************************************************************
    // Perform any other initialization here
    // *************************************************************************

    #if defined(USE_DEBUG)
        printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_\r\n");
    /*****************DEFINE SENSOR NODE*****************/
        #if defined(SENSOR1)
            printf("ZigBee Router Sensor1");
        #elif defined(SENSOR2)
            printf("ZigBee Router Sensor2");
        #elif defined(SENSOR3)
            printf("ZigBee Router Sensor3");
        #elif defined(SENSOR4)
            printf("ZigBee Router Sensor4");
        #elif defined(SENSOR5)
            printf("ZigBee Router Sensor5");
        #elif defined(SENSOR6)
            printf("ZigBee Router Sensor6");
        #elif defined(SENSOR7)
            printf("ZigBee Router Sensor7");
        #elif defined(SENSOR8)
            printf("ZigBee Router Sensor8");
        #elif defined(SENSOR9)
            printf("ZigBee Router Sensor9");
        #elif defined(SENSOR10)
            printf("ZigBee Router Sensor10");
        #elif defined(SENSOR11)
            printf("ZigBee Router Sensor11");
        #elif defined(SENSOR12)
            printf("ZigBee Router Sensor12");

