win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
        /*****************DEFINE ACTOR NODE*****************/
        #elif defined(I_AM_ACTOR1)
            printf("ZigBee Router Actor1");
        #elif defined(I_AM_ACTOR2)
            printf("ZigBee Router Actor2");

        #else
            #error "Router not supported."
        #endif

        printf(" - R&D by WSAN-Lab411\r\n");
        #if (RF_CHIP == MRF24J40)
            printf("Transceiver-MRF24J40\r\n");
        #else
            printf("Transceiver-Unknown\r\n");
        #endif
    #endif

    // Enable interrupts to get everything going.
    RFIE = SET;

    /* Start the network anew each time Node is booted up */
    NWKClearNeighborTable();
    #if defined(I_SUPPORT_BINDINGS)
        ClearBindingTable();
    #endif

    /* Clear the Group Table */
    RemoveAllGroups();

    #if defined(I_SUPPORT_BINDINGS)
        RemoveAllBindings(macPIB.macShortAddress);
    #endif

    /* Clearing nwk status flags */
    nwkStatus.flags.Val = 0x00;

    while (1)
    {
        /* Clear the watch dog timer */
        CLRWDT();

        /* Determine which is the next ZigBee Primitive to operate on */
        ZigBeeTasks( &currentPrimitive );

        /* Process the next ZigBee Primitive */
        ProcessZigBeePrimitives();
        
        /* do any non ZigBee related tasks and then go back to ZigBee tasks */
        ProcessNONZigBeeTasks();

        /* use led to identify if device joined */
        #if defined(USE_LED)
        #if defined(USE_MINI_RADAR_V2) || defined(USE_PIR)
            #if defined(USE_MINI_RADAR_V2)
            if(WSANFlags.bits.EnableReceiveMW == CLEAR)
            #endif
            #if defined(USE_PIR)
            if(WSANFlags.bits.EnableReceivePIR == CLEAR)
            #endif
            {
                if(Led_Count == CLEAR)
                {
                    if(ZigBeeStatus.flags.bits.bNetworkJoined == CLEAR)
                    {
                        WSAN_LED = ~WSAN_LED;
                        Led_Count = BLINK_LED_NOT_JOIN;
                    }
                    else
                    {
                        #if defined(USE_MINI_RADAR_V2)
                        WSANFlags.bits.EnableReceiveMW = SET;
                        #endif
                        #if defined(USE_PIR)
                        WSANFlags.bits.EnableReceivePIR = SET;
                        #endif
                        WSAN_LED = CLEAR;
                    }
                }
                else
                {
                    --Led_Count;
                }
            }
            #if defined(USE_MINI_RADAR_V2)
            else
            {
                ++CountLoop;
            }
            #endif

        #else
        if(Led_Count == 0)
        {
            WSAN_LED = ~WSAN_LED;

            if(ZigBeeStatus.flags.bits.bNetworkJoined)
                Led_Count = BLINK_LED_JOIN;
            else
                Led_Count = BLINK_LED_NOT_JOIN;
        }
        else
        {
            --Led_Count;
        }
        #endif
        #endif
    }
}

void ProcessZigBeePrimitives(void)
{
    switch (currentPrimitive)
    {
        case NLME_ROUTE_DISCOVERY_confirm:
            #if defined(USE_DEBUG)
                if (!params.NLME_ROUTE_DISCOVERY_confirm.Status)
                {
                    printf("Route Reply OK\r\n" );
                }
                else
                {
                    PrintChar( params.NLME_ROUTE_DISCOVERY_confirm.Status );
                    printf(" Route Reply Failed\r\n" );
                }
            #endif
            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_NETWORK_DISCOVERY_confirm:
            currentPrimitive = NO_PRIMITIVE;

            switch(params.NLME_NETWORK_DISCOVERY_confirm.Status)
            {
                case 0x00:
                    #if defined(USE_DEBUG)
                        printf("Number of Zigbee network have been find: ");
                        PrintChar(params.NLME_NETWORK_DISCOVERY_confirm.NetworkCount);
                        printf("\r\n");
                    #endif
                    // Save the descriptor list pointer so we can destroy it later.
                    NetworkDescriptor = params.NLME_NETWORK_DISCOVERY_confirm.NetworkDescriptor;

                    // Select a network to try to join.  We're not going to be picky right now...
                    currentNetworkDescriptor = NetworkDescriptor;

SubmitJoinRequest:
                    params.NLME_JOIN_request.PANId = currentNetworkDescriptor->PanID;

                    #if defined(USE_DEBUG)
                        printf("Prepare join to network: 0x");
                        PrintWord(params.NLME_JOIN_request.PANId.Val);
                        printf("\r\n");
                    #endif

                    if(params.NLME_JOIN_request.PANId.Val != DesireNetworkID)
                    {
                        currentNetworkDescriptor = currentNetworkDescriptor->next;
                        if(currentNetworkDescriptor)
                        {
                            goto SubmitJoinRequest;
                        }
                        else
                        {
                            #ifdef USE_DEBUG
                                #if defined(THEODOIDONGVAT)
                                printf("Not found desire network 0x1AAB\r\n");
                                #endif

                                #if defined(CHAMSOCLAN)
                                printf("Not found desire network 0x1AAC\r\n");
                                #endif

                                #if defined(CANHBAOCHAYRUNG)
                                printf("Not found desire network 0x1AAA\r\n");
                                #endif
                            #endif

                            ZigBeeStatus.flags.bits.bNetworkJoined = 0;
                            ZigBeeStatus.flags.bits.bTryingToJoinNetwork = 0;
                        }
                    }
                    else
                    {
                        #ifdef USE_DEBUG
                            #if defined(THEODOIDONGVAT)
                            printf("Found desire network 0x1AAB\r\n");
                            #endif

                            #if defined(CHAMSOCLAN)
                            printf("Found desire network 0x1AAA\r\n");
                            #endif

                            #if defined(CANHBAOCHAYRUNG)
                            printf("Found desire network 0x1AAA\r\n");
                            #endif
                        #endif
                        params.NLME_JOIN_request.JoinAsRouter   = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork  = FALSE;
                        params.NLME_JOIN_request.PowerSource    = NOT_MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle   = TRUE;
                        params.NLME_JOIN_request.MACSecurity    = FALSE;
                        params.NLME_JOIN_request.ExtendedPANID = currentNetworkDescriptor->ExtendedPANID;

                        currentPrimitive = NLME_JOIN_request;

