win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
        case NLME_RESET_confirm:
            #if defined(USE_DEBUG)
                printf("ZigBee Stack has been reset\r\n" );
            #endif
            /* For Zigbee 2006 The Specs require that node needs to
             * try joining as an orphan first after each reset,
             * see Mandatory test 3.9
             */
            ZigBeeStatus.flags.bits.bTryOrphanJoin = SET;

            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_LEAVE_confirm:
            #if defined(USE_DEBUG)
                PrintChar(params.NLME_LEAVE_confirm.Status);
                printf(" Leaving the Zigbee network\r\n" );
            #endif

            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSDE_DATA_indication:
            {
                #ifndef THEODOIDONGVAT
                    BYTE data;
                #endif

                currentPrimitive = NO_PRIMITIVE;

                switch (params.APSDE_DATA_indication.DstEndpoint)
                {
                    case WSAN_Endpoint:
                    {
                        switch (params.APSDE_DATA_indication.ClusterId.Val)
                        {
                            //user clusterID application
                            #ifdef USE_SAVE_ENERGY_MODE
                                case SAVE_ENERGY_SYN_CLUSTER:
                                {
                                    APLGet();
                                    SendOneByte(MAC_LONG_ADDR_BYTE0, SAVE_ENERGY_CONFIRM_CLUSTER);
                                    WSANFlags.bits.DeviceMode = SaveEnergyMode;
                                    TimerCount = 0;
                                    #ifdef USE_DEBUG
                                        printf("Change to mode SaveEnergy\r\n");
                                    #endif
                                }
                                break;

                                case ACTIVE_SYN_CLUSTER:
                                {
                                    SendOneByte(MAC_LONG_ADDR_BYTE0, ACTIVE_CONFIRM_CLUSTER);
                                    WSANFlags.bits.DeviceMode = ActiveMode;
                                    TimerCount = 0;
                                    #ifdef USE_DEBUG
                                        printf("Change to mode Active\r\n");
                                    #endif
                                }
                                break;
                            #endif

                            #if defined (TRACE_ROUTE_SUPPORT)
                                case ROUTE_DRAW_REQUEST_CLUSTER:
                                {
                                    BYTE i;
                                    BYTE MSB_dest_addr;
                                    BYTE LSB_dest_addr;
                                    BYTE NodeNumber;
                                    BYTE *pListOfNode;
                                    MSB_dest_addr = APLGet();//Lay ra dia chi dich can tim tuyen
                                    LSB_dest_addr = APLGet();
                                    NodeNumber    = APLGet();//So Node can di qua
                                    for (i = 0; i< NodeNumber; i++) pListOfNode[i] = APLGet();//Lay ra byte 0 dia chi MAC tat ca cac node di qua
                                    if ((macPIB.macShortAddress.v[1] == MSB_dest_addr)&&(macPIB.macShortAddress.v[0] == LSB_dest_addr)) RouteDrawReply(NodeNumber, pListOfNode);//Neu la node dich thi gui ket qua ve ROUTER_EMB
                                    else RouteDrawRequestToNextHop(MSB_dest_addr, LSB_dest_addr, NodeNumber, pListOfNode);//tiep tuc gui tin yeu cau ve tuyen den node tiep theo
                                }
                                break;
                            #endif

                            #if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
                                case ACTOR_REQUEST_CLUSTER:
                                {
                                    //cau truc ban tin yeu cau bat bom tu router-emboard
                                    //------------------------------------------------------------------------------------
                                    // 0bSVVVVVVV
                                    // S = 0 --> tat, S = 1 --> bat
                                    // VVVVVVV --> van nao duoc bat/tat, dac biet, neu VVVVVVV = 0b1111111 thi tat ca ca van duoc bat/tat
                                    //------------------------------------------------------------------------------------
                                    data = APLGet();// lay lenh bat/tat bom tuoi
                                    ConsolePut(data);//lenh nay dung that khi bat dieu khien may bom.
                                }
                                break;
                            #endif

                            #if defined(USE_SHT10)
                                case HTE_REQUEST_CLUSTER://gui du lieu nhiet do do am ma emboard yeu cau
                                {
                                    //ban tin yeu cau lay du lieu nhiet do - do am tu bo nhung co dang: 0x00
                                    data = APLGet();
                                    LoadSHT10();//lay du lieu nhiet do - do am
                                    Send_HTE_ToRouterEmboard(HTE_RESPONSE_CLUSTER);
                                    #if defined(USE_DEBUG)
                                        printf("Just sent data for request of Router_EMB\r\n");
                                    #endif
                                }
                                    break;

                                case RE_CONFIG_CYCLE_CLUSTER:
                                {
                                    data = APLGet();
                                    CYCLE_SENDING = data * 60;//data = 1 -> 5phut, data = 2 -> 10 phut,...
                                    #if defined(CHAMSOCLAN)
                                    TimerCount = (data + 3) * MAC_LONG_ADDR_BYTE0;//lam lech thoi gian gui du lieu, cach nhau
                                    #endif
                                    #if defined(CANHBAOCHAYRUNG)
                                    TimerCount = (data + 3) * (MAC_LONG_ADDR_BYTE0-0x30);//lam lech thoi gian gui du lieu, cach nhau
                                    #endif
                                    #ifdef USE_DEBUG
                                        printf("CYCLE_LEVEL = ");
                                        PrintChar(CYCLE_SENDING);
                                        printf("\r\n");
                                    #endif

