win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
                                }
                                break;
                            #endif

                            #if defined(USE_MQ6_V1)
                                case RE_ASSIGN_LEVEL_MQ6_CLUSTER:
                                {
                                    data = APLGet();
                                    ThresholdMQ6 = Threshold_0 + data * STEP_OF_THRES;
                                    #ifdef USE_DEBUG
                                        printf("MQ6_LEVEL = ");
                                        PrintWord(ThresholdMQ6);
                                        printf("\r\n");
                                    #endif
                                }
                                break;

                            #endif

                            case 0x0005:
                            case 0x0006:
                                #ifdef USE_DEBUG
                                    printf("Sending loop back\r\n");
                                #endif
                                break;

                            case PING_REQUEST_CLUSTER:
                                #ifdef USE_DEBUG
                                    printf("Ping from Gateway\r\nResponse to Gateway!");
                                #endif
                                APLGet();//bo di 0xFF
                                SendOneByte(MAC_LONG_ADDR_BYTE0, PING_CONFIRM_CLUSTER);
                                break;
                                
                            default:
                                /* Catch all place for all none ZDO msgs not processed above */
                                #if defined(USE_DEBUG)
                                    PrintWord(params.APSDE_DATA_indication.ClusterId.Val);
                                    PrintChar(APLGet());
                                    printf(" Non-support ClusterID...\r\n");
                                #endif
                                break;
                        }
                        if (currentPrimitive != APSDE_DATA_request)
                        TxData = TX_DATA_START;//reset lai chi so TxData
                    }
                        break;

                    default:
                        break;
                }
                APLDiscardRx();
            }
            break;

        case APSDE_DATA_confirm:
            if (params.APSDE_DATA_confirm.Status)
            {
                #if defined(USE_DEBUG)
                    PrintChar(params.APSDE_DATA_confirm.Status);
                    printf(" Error sending message\r\n");
                #endif
            }
            else
            {
                #if defined(USE_DEBUG)
                    printf("Sending message OK!\r\n" );
                #endif

                #if defined(USE_SAVE_ENERGY_MODE)
                    //Gui xac nhan ve RE da hoat dong o che do save energy thanh cong thi lam viec nay!
                    if (WSANFlags.bits.DeviceMode)
                    {
                        SleepingState = SET;//vao trang thai ngu
                        WakingState = CLEAR;
                    }
                #endif
            }
                
            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSME_ADD_GROUP_confirm:
        case APSME_REMOVE_GROUP_confirm:
        case APSME_REMOVE_ALL_GROUPS_confirm:
            #if defined(USE_DEBUG)
                printf("Perform Group Operation\r\n" );
            #endif
            currentPrimitive = NO_PRIMITIVE;
            break;

        /* if nothing to process first check to see if we are in startup seqence */
        case NO_PRIMITIVE:
            if (AllowJoin && (!ZigBeeStatus.flags.bits.bNetworkJoined))
            {
                if (!ZigBeeStatus.flags.bits.bTryingToJoinNetwork)
                {
                    if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                    {
                        #if defined(USE_DEBUG)
                            printf("Trying to join network as an orphan...\r\n" );
                        #endif

                        params.NLME_JOIN_request.ScanDuration     = 8;
                        params.NLME_JOIN_request.ScanChannels.Val = ALLOWED_CHANNELS;
                        params.NLME_JOIN_request.JoinAsRouter     = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork    = 0x01;//rejoining the network using the orphaning procedure
                        params.NLME_JOIN_request.PowerSource      = NOT_MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle     = TRUE;
                        params.NLME_JOIN_request.MACSecurity      = FALSE;

                        params.NLME_JOIN_request.ExtendedPANID    = currentNetworkDescriptor->ExtendedPANID;
                        currentPrimitive = NLME_JOIN_request;
                    }
                    else
                    {
                        #if defined(USE_DEBUG)
                            printf("Trying to join network as a new device...\r\n" );
                        #endif
                        params.NLME_NETWORK_DISCOVERY_request.ScanDuration          = 8;
                        params.NLME_NETWORK_DISCOVERY_request.ScanChannels.Val      = ALLOWED_CHANNELS;
                        currentPrimitive = NLME_NETWORK_DISCOVERY_request;
                    }
                }
            }
            else
            {
                if(!ZigBeeStatus.flags.bits.bHasBackgroundTasks)
                {
                    // ************************************************************************
                    // Place all processes that can send messages here.  Be sure to call
                    // ZigBeeBlockTx() when currentPrimitive is set to APSDE_DATA_request.
                    // ************************************************************************
                    #if defined(USE_MQ6_V1) || defined(USE_MQ6_V2)
                        //gui thong tin co khoi ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.MQ6Warning)
                        {
                            WSANFlags.bits.MQ6Warning = CLEAR;
                            WSANFlags.bits.DisableSendingMsg = SET;//Khong cho phep nhan ngat tu MQ6 nua
                            SendOneByte(DetectingSmoke,STATE_NODE_CLUSTER);//thong bao co khoi ve router-emboard
                            #if defined(USE_DEBUG)
                                printf("Sending warning fire-forest to RE\r\n");
                            #endif
                        }
                    #endif
		
                    #if defined(USE_WARNING_LOW_POWER)
                        //gui thong tin sap het nang luong ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.LowPowerWarning)
                        {
                            WSANFlags.bits.LowPowerWarning = CLEAR;
                            
                            if(NumberOfWarning == 0)
                            {
                                SUPPLY_VOLT_ZENER = CLEAR;//tat nguon cap cho diode zener
                                AD1CON1bits.ADON = CLEAR;//tat module ADC
                                #if defined(USE_LED)
                                    WSAN_LED_TRIS = 1;
                                #endif
                            }
                            else
                            {
                                --NumberOfWarning;
                                SendOneByte(LowPower,STATE_NODE_CLUSTER);
                                #if defined(USE_DEBUG)
                                    printf("Sending warning low-power to RE\r\n");
                                #endif
                            }
                        }
                    #endif

