win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
                    #if defined(USE_SHT10)
                        //gui thong tin nhiet do-do am dinh ky ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.HTE_Data_Ready)
                        {
                            WSANFlags.bits.HTE_Data_Ready = CLEAR;
                            Send_HTE_ToRouterEmboard(HTE_AUTO_SEND_CLUSTER);
                            #if defined(USE_DEBUG)
                                printf("Sending period data to RE \r\n");
                            #endif
                        }
                    #endif

                    #if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
                        if(ZigBeeReady() && WSANFlags.bits.ActorAckReceive)
                        {
                            WSANFlags.bits.ActorAckReceive = CLEAR;
                            SendOneByte(StatusActor,ACTOR_RESPONSE_CLUSTER);//bao ve Gateway da ra lenh dieu khien bat/tat van tuoi
                            
                            #if defined(USE_DEBUG)
                                printf("Sending confirm of pump to RE\r\n");
                            #endif
                        }
                    #endif

                    #if defined(I_AM_ACTOR2) || defined(I_AM_ACTOR1)
                        #if !defined(USE_SAVE_ENERGY_MODE)
                        if(ZigBeeReady() && WSANFlags.bits.EnablePingToRE)
                        {
                            WSANFlags.bits.EnablePingToRE = CLEAR;
                            SendOneByte(MAC_LONG_ADDR_BYTE0, JOIN_CONFIRM_CLUSTER);//5 phut lai gui ban tin ve RE de xac nhan su co mat cua ACTOR2
                            #if defined(USE_DEBUG)
                                printf("Just ping to RE\r\n");
                            #endif
                        }
                        #endif
                    #endif

                    #if defined(USE_PIR)
                        if(ZigBeeReady() && WSANFlags.bits.PIRDetecting)
                        {
                            WSANFlags.bits.PIRDetecting = CLEAR;
                            SendOneByte(DetectingByPIR,STATE_NODE_CLUSTER);
                            #ifdef USE_DEBUG
                                printf("Sending warning strange-object PIR to RE\r\n");
                            #endif
                        }
                    #endif

                    #if defined(USE_MINI_RADAR_V2)
                        //gui ban tin canh bao chuyen dong khi phat hien + ban tin kiem tra tinh trang hoat dong cua cam bien.
                        if(ZigBeeReady() && WSANFlags.bits.MicrowaveDetecting)
                        {
                            WSANFlags.bits.MicrowaveDetecting = CLEAR;
                            SendOneByte(DetectingByMicroWave,STATE_NODE_CLUSTER);
                            #ifdef USE_DEBUG
                                printf("Sending warning strange-object MW to RE\r\n");
                            #endif
                        }
                    #endif
                }
            }

            #ifdef USE_SAVE_ENERGY_MODE
                if (WSANFlags.bits.DeviceMode)
    		{
                    if ((SleepingState)&&(!WakingState)&&(TimerCount == WAKE_DURATION))
                    {
                        #ifdef USE_DEBUG
                            printf("Bat dau ngu \r\n");
                        #endif
                        Sleep_Tranceiver();
                        #ifdef USE_LED
                            WSAN_LED = ~WSAN_LED;
                        #endif
                        SleepingState = CLEAR;
                        WakingState = SET;
                        TMR2 = 0x0000;
                        TMR3 = 0x0000;
                        TimerCount = 0;
                    }
                    if ((WakingState)&&(!SleepingState)&&(TimerCount == SLEEP_DURATION))
                    {
                        #ifdef USE_DEBUG
                            printf("Bat dau thuc \r\n");
                        #endif
                        WakeUp_Tranceiver();
                        #ifdef USE_LED
                            WSAN_LED = ~WSAN_LED;
                        #endif
                        CLRWDT();
                        ENABLE_WDT();
                        NetworkDescriptor = NULL;
                        orphanTries = 3;

                        // If you are going to send data to a terminal, initialize the UART.
                        #if defined(USE_DEBUG) || defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
                            ConsoleInit();
                        #endif

                        // Initialize the hardware - must be done before initializing ZigBee.
                        HardwareInit();

                        // Initialize the ZigBee Stack.
                        ZigBeeInit();
                        currentPrimitive = NO_PRIMITIVE;

                        // SET interrupts to get everything going.
                        RFIE = SET;

                        /* Initialize my status flags*/
                        WSANFlags.Val = 0x0000;

                        /* Start the network anew each time Node is booted up */
                        NWKClearNeighborTable();
                        #if defined(I_SUPPORT_BINDINGS)
                            ClearBindingTable();
                        #endif

                        /* Clear the Group Table */
                        RemoveAllGroups();

                        #if defined(I_SUPPORT_BINDINGS)
                            RemoveAllBindings(macPIB.macShortAddress);
                        #endif

                        /* Clearing nwk status flags */
                        nwkStatus.flags.Val = 0x00;
                        SleepingState = SET;
                        WakingState = CLEAR;
                        TMR2 = 0x0000;
                        TMR3 = 0x0000;
                        SendDataAfterSleep = SET;//sau khi thuc day, bat co nay cho phep gui du lieu ve bo nhung
                        TimerCount = 0;
                    }
                }
            #endif
            break;

        default:
            #if defined(USE_DEBUG)
                PrintChar( currentPrimitive );
                printf(" Unhandled primitive\r\n" );
            #endif
            currentPrimitive = NO_PRIMITIVE;
            break;
    }
}

void ProcessNONZigBeeTasks(void)
{
    // *********************************************************************
    // Place any non-ZigBee related processing here.  Be sure that the code
    // will loop back and execute ZigBeeTasks() in a timely manner.
    // *********************************************************************
    #if defined(USE_SHT10)
        //Lay du lieu nhiet do-do am
        if(WSANFlags.bits.EnableGetDataHTE)
        {
            WSANFlags.bits.EnableGetDataHTE = CLEAR;
            LoadSHT10();

