win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
            #if defined(USE_DEBUG)
                printf("Temperature (hex): ");
                PrintWord(temperature);
                printf("\r\n");

                printf("Humidity (hex): ");
                PrintWord(humidity);
                printf("\r\n");
            #endif

            WSANFlags.bits.HTE_Data_Ready = SET;//cho phep gui du lieu dinh ki ve gateway
        }

        #if defined(USE_SAVE_ENERGY_MODE)
	if (SendDataAfterSleep)
        {
            WSANFlags.bits.EnableGetDataHTE = SET;
            SendDataAfterSleep = CLEAR;
        }
        #endif
    #endif

    #if defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)
    if (WSANFlags.bits.MQ6orVoltage == Finish_Convert)
    {
        #if defined(USE_DEBUG)
            /* Hien thi ket qua tu cam bien khoi */
            printf("MQ6 signal (hex): ");
            PrintWord(Mq6Signal);
            printf("\r\n");

            /* Hien thi ket qua do dien ap nguon */
            printf("Voltage (hex): ");
            PrintWord(Energy_Level);
            printf("\r\n");
        #endif

        if(WSANFlags.bits.DisableGetThresMq6 == 0)
        {
            if(WSANFlags.bits.OnTimeGetMQ6 == 1)
            {
                Threshold_0 = Mq6Signal + 125;//lay nguong canh bao chay co ban.
                ThresholdMQ6 = Threshold_0;//gia tri nguong nay thay doi duoc dua tren gia tri nguong co ban.
                #if defined(USE_DEBUG)
                    printf("Theshold MQ6 signal (hex): ");
                    PrintWord(ThresholdMQ6);
                    printf("\r\n");
                #endif
                WSANFlags.bits.DisableGetThresMq6 = 1;
            }
        }
        else
        {
            if (Mq6Signal > ThresholdMQ6)
            {
                #if defined(USE_DEBUG)
                    printf("Detecting smoke\r\n");
                #endif
                WSANFlags.bits.MQ6Warning = SET;//kich hoat viec gui tin hieu ve router emboard
            }
        }

        if (Energy_Level > ThresholdPower)
        {
            #if defined(USE_DEBUG)
                printf("Detecting low power\r\n");
            #endif
            WSANFlags.bits.LowPowerWarning = SET;//kich hoat viec gui tin hieu ve router emboard
        }

        Mq6Signal = 0;//Clear this variable to reuse
        WSANFlags.bits.MQ6orVoltage = Power_Mode_ADC;//start with new cycle
    }
    #endif

    #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
    if(WSANFlags.bits.CompleteADC)
    {
        #if defined(USE_DEBUG)
            printf("Voltage (hex): ");
            PrintWord(Energy_Level);
            printf("\r\n");
        #endif
        if (Energy_Level > ThresholdPower)
        {
            #if defined(USE_DEBUG)
                printf("Detecting low power\r\n");
            #endif
            WSANFlags.bits.LowPowerWarning = SET;
        }
        WSANFlags.bits.CompleteADC = CLEAR;
    }
    #endif

    #if !defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)

    if(WSANFlags.bits.CompleteADC)
    {
        #if defined(USE_DEBUG)
            printf("MQ6 signal (hex): ");
            PrintWord(Mq6Signal);
            printf("\r\n");
        #endif

        if(WSANFlags.bits.DisableGetThresMq6 == 0)
        {
            if(WSANFlags.bits.OnTimeGetMQ6 == 1)
            {
                Threshold_0 = Mq6Signal + 125;
                ThresholdMQ6 = Threshold_0;
                #if defined(USE_DEBUG)
                    printf("Theshold MQ6 signal (hex): ");
                    PrintWord(ThresholdMQ6);
                    printf("\r\n");
                #endif
                WSANFlags.bits.DisableGetThresMq6 = 1;
            }
        }
        else
        {
            if (Mq6Signal > ThresholdMQ6)
            {
                #if defined(USE_DEBUG)
                    printf("Detecting smoke\r\n");
                #endif
                WSANFlags.bits.MQ6Warning = SET;
            }
        }
        
        Mq6Signal = 0;//Clear this variable to reuse

        WSANFlags.bits.CompleteADC = CLEAR;
    }
    #endif

    #if defined(USE_PIR) && defined(USE_LED)
    if(WSANFlags.bits.EnableReceivePIR)
    {
        if(PORTFbits.RF6)
            WSAN_LED = CLEAR;
        else
            WSAN_LED = SET;
    }
    #endif
}

/*******************************************************************************
HardwareInit

All port directioning and SPI must be initialized before calling ZigBeeInit().

For demonstration purposes, required signals are configured individually.
*******************************************************************************/
void HardwareInit(void)
{
    /*Configure digital pins @ added by dat_a3cbq91*/
    ANSE = 0x0000;
    ANSG = 0x0000;
    ANSD = 0x0000;

    /*Configure for SPI communication*/
    #if(CLOCK_FREQ < 1000000)
        //SPI1 for RF transceiver
        SPI1CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI1STAT = 0x8000;

        //SPI2 for EEPROM
        SPI2CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI2STAT = 0x8000;
    #else
        //comment by dat_a3cbq91
        /* SPI1 for RF transceiver */
        SPI1CON1 = 0b0000000100111110;  //PIC24FJ128GA306 is Master, MRF24J40 is Slaver
                                        //Internal SPI clock is enabled
                                        //SDO1 pin is controlled by the module
                                        //Communication is byte-wide (8 bits)
                                        //Input data is sampled at the middle of data output time
                                        //Serial output data changes on transition from active clock state to Idle clock state
                                        //~SS1 pin is not used by the module; pin is controlled by the port function
                                        //Idle state for the clock is a low level; active state is a high level
                                        //Secondary prescale 1:1
                                        //Primary prescale 4:1 -> CLOCK_FREQ/2/4 as SPI CLOCK

        //Enables module and configures SCKx, SDOx, SDIx and ~SSx as serial port pins
        //Interrupt when the last data in the receive buffer is read; as a result, the buffer is empty (SRXMPT bit is set)
        SPI1STAT = 0x8000;

