win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
        /* SPI2 for EEPROM */
        //same as configuration SPI1 module
        SPI2CON1 = 0b0000000100111110;
        SPI2STAT = 0x8000;
    #endif

    #ifdef USE_EXTERNAL_NVM
    	EEPROM_nCS	= 1;
    	EEPROM_nCS_TRIS	= 0;
    	IFS2bits.SPI2IF = 1;
    #endif

    PHY_RESETn = 0;
    PHY_RESETn_TRIS = 0;
    PHY_CS = 1;
    PHY_CS_TRIS = 0;

    RFIF = 0;
    RFIE = 1;

    if(RF_INT_PIN == 0)
    {
        RFIF = 1;
    }

    /*Configure for other modules that designed by lab411*/
    // configure for led module
    #if defined(USE_LED)
        WSAN_LED_TRIS = 0;
        WSAN_LED = CLEAR;//Clear Led to a initialize state
    #endif
    
    // configure for ADC module
        //config for pin
    #if defined(USE_WARNING_LOW_POWER) || defined(USE_MQ6_V1)
        #if defined(USE_WARNING_LOW_POWER)
            //input analog at AN8
            VOLTAGE_MEASURE_ANALOG = SET;
            VOLTAGE_MEASURE_TRIS = 1;
            //SET supply voltage to Zener Diode
            SUPPLY_VOLT_ZENER_TRIS = 0;
            SUPPLY_VOLT_ZENER = SET;
        #endif
        
        #if defined(USE_MQ6_V1)
            MQ6_MEASURE_ANALOG = SET;
            MQ6_MEASURE_TRIS = 1;
        #endif

        //configure ADC module
        AD1CON1 = 0x0470;//12-bit A/D operation
                        //Output format bit is absolute decimal result, unsigned, right-justified
                        //Internal counter ends sampling and starts conversion
                        //Sampling begins when SAMP bit is manually set

        AD1CON2 = 0x0800;//VDD is voltage reference
                        //AD1CON2 = 0x4800;//external positive voltage reference --> for measure signal from smoke sensor
                        //Conversion result is loaded into the buffer POWER_SUPPLY_BUFF
                        //Interrupt at the completion of conversion for each sample
                        //Always uses channel input selects for Sample A

        AD1CON3 = 0x1F02;//Sample Time = 31Tad, Tad = 3Tcy

        #if defined(USE_WARNING_LOW_POWER)
            AD1CHS = VOLTAGE_MEASURE_CHANNEL;//do dien ap dau tien
        #else
            AD1CHS = MQ6_MEASURE_CHANNEL;//do MQ6
        #endif

        AD1CON1bits.ADON = SET;//bat dau lay gia tri dien ap
        
        //config for ADC interrupt
        IFS0bits.AD1IF = CLEAR;
        IEC0bits.AD1IE = SET;
        IPC3bits.AD1IP = 6;
    #endif

    // configure for I2C software module to connect with SHT sensor.
    #if defined(USE_SHT10)
        // Make RG2, RG3 outputs.
        SCK_TRIS    =   CLEAR;
        DATA_TRIS   =   CLEAR;
    #endif

    
    // configure interface to connect with PIR
    #if defined(USE_PIR) || defined(USE_MQ6_V2)

        INTCON1bits.NSTDIS = 1;//Interrupt nesting is disabled
        INTCON2bits.INT0EP = 1;//neg edge

        IPC0bits.INT0IP = 0b111;// Interrupt priority level 7

        IFS0bits.INT0IF = CLEAR;// Interrupt request has not occurred
        IEC0bits.INT0IE = SET;

        TRISFbits.TRISF6 = 1;//RF6 connect to signal wire of PIR or MQ6_V2
    #endif

    #if defined(USE_MINI_RADAR_V2)
        INTCON1bits.NSTDIS = 1;//Interrupt nesting is disabled
        INTCON2bits.INT0EP = 0;//pos edge

        IPC0bits.INT0IP = 0b111;// Interrupt priority level 7

        IFS0bits.INT0IF = CLEAR;// Interrupt request has not occurred
        IEC0bits.INT0IE = SET;

        TRISFbits.TRISF6 = 1;//RF6 connect to signal wire of PIR or MQ6_V2
    #endif

    #if defined(USE_MINI_RADAR_V3)
        //Set the IC32 bits
        IC2CON2bits.IC32 = 1;
        IC1CON2bits.IC32 = 1;

        IC2CON1bits.ICTSEL = 0b111;
        IC2CON2bits.SYNCSEL = 0b10000;
        IC1CON1bits.ICTSEL = 0b111;
        IC1CON2bits.SYNCSEL = 0b10000;

        IC2CON2bits.ICTRIG = 0;

        //Interrupt on every capture event
        IC1CON1bits.ICI = 0b00;

        IC1CON2bits.ICTRIG = 0;

        IC1CON1bits.ICM = 0b011;

        while(IC1CON1bits.ICBNE)
        {
            past_ICtimer = IC2BUF;
            past_ICtimer << 16;
            past_ICtimer = past_ICtimer | IC1BUF;
        }
    #endif
}

/*******************************************************************************
User Interrupt Handler

The stack uses some interrupts for its internal processing. Once it is done
checking for its interrupts, the stack calls this function to allow for any
additional interrupt processing.
*******************************************************************************/

//this routine is written by dat_a3cbq91
void _ISR __attribute__((interrupt, auto_psv)) _T3Interrupt(void)
{
    IFS0bits.T3IF = CLEAR;

    //if (SleepingStateTimerFlag) SleepTimer ++;
    
    if (WSANFlags.bits.DeviceMode == ActiveMode)//Devicemode = 1 --> Save Energy.
    {
        if (TimerCount == CYCLE_SENDING)
        {
            TimerCount = CLEAR;

            //SET get temperature and humidity from SHT10 every (5*CYCLE_SENDING)s
            #if defined(USE_SHT10)
                WSANFlags.bits.EnableGetDataHTE = SET;
            #endif

            //start sampling for conversion to digital
            #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
                AD1CON1bits.SAMP = SET;
            #endif

            #if defined(I_AM_ACTOR1) || defined(I_AM_ACTOR2)
                WSANFlags.bits.EnablePingToRE = SET;
            #endif

            #if defined(USE_MQ6_V1) || defined(USE_MQ6_V2)
                WSANFlags.bits.OnTimeGetMQ6 = SET;
            #endif

        }
        else
        {
            TimerCount++;
        }
        //start sampling for conversion to digital. every 5s meassure MQ6 signal
        #if defined(USE_MQ6_V1)
            AD1CON1bits.SAMP = SET;
        #endif

        #if defined(USE_MQ6_V2)
            if(WSANFlags.bits.DisableSendingMsg)
            {
                --TimeBlockMQ6;
                if(TimeBlockMQ6 == 0)
                {
                    WSANFlags.bits.DisableSendingMsg = CLEAR;
                    TimeBlockMQ6 = BlockMaxMQ6;
                }
            }
        #endif

        #if defined(USE_MINI_RADAR_V2)
            if(WSANFlags.bits.BlockMiniradarV2 == SET)
            {
                --TimeBlockMiniRadar;
                if(TimeBlockMiniRadar == 0)
                {
                    WSANFlags.bits.BlockMiniradarV2 = CLEAR;
                    TimeBlockMiniRadar = BlockMaxRadar;
                    #if defined(USE_LED)
                    WSAN_LED = CLEAR;
                    #endif
                    #if defined(USE_DEBUG)
                    printf("Cho phep ngat boi miniradar V2\r\n");
                    #endif
                }
            }
        #endif
    }

    //if you don't want print neighbor of this node, comment the following
    //WSANFlags.bits.PrintNeighborTable = SET;
}

#if defined(USE_MQ6_V1) || defined(USE_WARNING_LOW_POWER)
void _ISR __attribute__((interrupt, auto_psv)) _ADC1Interrupt(void)
{
    IFS0bits.AD1IF = CLEAR;
    //Lay gia tri chuyen doi ADC
    #if defined(USE_MQ6_V1) && defined(USE_WARNING_LOW_POWER)
        switch(WSANFlags.bits.MQ6orVoltage)
        {
            case Power_Mode_ADC:
                Energy_Level = POWER_SUPPLY_BUFF;//lay gia tri dien ap tu zener de suy ra VDD
                AD1CHS = MQ6_MEASURE_CHANNEL;//chuyen sang do mq6
                WSANFlags.bits.MQ6orVoltage = MQ6_Mode_ADC;
                break;

            case MQ6_Mode_ADC:
                if(k == 0)
                {
                    k = 8;
                    Mq6Signal = Mq6Signal >> 3;//chia 8 lay gia tri trung binh
                    AD1CHS = VOLTAGE_MEASURE_CHANNEL;//chuyen sang do voltage
                    #if defined(USE_LED)
                        WSAN_LED = ~WSAN_LED;
                    #endif
                    WSANFlags.bits.MQ6orVoltage = Finish_Convert;
                }
                else
                {
                    #if defined(USE_DEBUG)
                        ConsolePut(k+0x30);
                        printf("\r\n");
                    #endif
                    --k;
                    Mq6Signal = Mq6Signal + MQ6_BUFF;//lay gia tri dien ap tu mq6
                    AD1CON1bits.SAMP = SET;
                }                
                break;

            default:
                break;
        }
    #endif

    #if defined(USE_MQ6_V1) && !defined(USE_WARNING_LOW_POWER)
        if(k == 0)
        {
            k = 8;
            Mq6Signal = Mq6Signal >> 3;//chia 8 lay gia tri trung binh
            #if defined(USE_LED)
                WSAN_LED = ~WSAN_LED;
            #endif
            WSANFlags.bits.CompleteADC = SET;
        }
        else
        {
            #if defined(USE_DEBUG)
                ConsolePut(k+0x30);
                printf("\r\n");
            #endif
            --k;
            Mq6Signal = Mq6Signal + MQ6_BUFF;//lay gia tri dien ap tu mq6
            AD1CON1bits.SAMP = SET;
        }
    #endif

