win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
    #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
        Energy_Level = POWER_SUPPLY_BUFF;
        WSANFlags.bits.CompleteADC = SET;
    #endif
}
#endif

#if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
void _ISR __attribute__((interrupt, auto_psv)) _U2RXInterrupt(void)
{
    IFS1bits.U2RXIF = CLEAR;
    StatusActor = U2RXREG;
    if(StatusActor)
        WSANFlags.bits.ActorAckReceive = SET;
}
#endif


#if defined(USE_PIR)
void _ISR __attribute__((interrupt, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = CLEAR;
    if(WSANFlags.bits.EnableReceivePIR)
    {
        for(i = 200; i > 0; --i);//eliminate noise
        if(PORTFbits.RF6 == 0)
        {
            WSANFlags.bits.PIRDetecting = SET;
        }
    }
}
#endif

#if defined(USE_MINI_RADAR_V2)
void _ISR __attribute__((interrupt, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = CLEAR;
    if(WSANFlags.bits.EnableReceiveMW)
    {
        for(i = 200; i > 0; --i);//eliminate noise
        if(PORTFbits.RF6)
        {
            if(WSANFlags.bits.BlockMiniradarV2 == CLEAR)
            {
                switch(count)
                {
                    case CLEAR:
                    {
                        ++count;
                        past_count = CountLoop;
                    }
                        break;

                    case MaxCount:
                    {
                        count = CLEAR;
                        WSANFlags.bits.MicrowaveDetecting = SET;
                        WSANFlags.bits.BlockMiniradarV2 = SET;//khong xu ly tin hieu ngat tu miniradar trong 2s

                        #if defined(USE_LED)
                            WSAN_LED = SET;
                        #endif
                        #if defined(USE_DEBUG)
                            printf("Phat hien doi tuong di chuyen\r\n");
                        #endif
                    }
                        break;

                    default:
                    {

                        //pre_count = CountLoop;
                        diff = CountLoop - past_count;
                        //if(diff < 1500)
                        if(diff < 2000)
                        {
                            #if defined(USE_DEBUG)
                                printf("Gia tri giua 2 lan ngat lien tiep: ");
                                PrintWord(diff);
                                printf("\r\n");
                            #endif
                            ++count;
                            past_count = CountLoop;
                        }
                        else
                        {
                            #if defined(USE_DEBUG)
                                printf("So xung nhieu: ");
                                PrintChar(count);
                                printf(". Bo qua nhieu!!!\r\n");
                            #endif
                            count = 0;
                        }
                    }
                        break;
                }
            }
//            #if defined(USE_DEBUG)
//            else
//            {
//                printf("Miniradar tam thoi dung hoat dong\r\n");
//            }
//            #endif
        }
    }
}
#endif

 #if defined(USE_MINI_RADAR_V3)
void _ISR __attribute__((interrupt, auto_psv)) _IC2Interrupt(void)
{
    IFS0bits.IC2IF = 0;

    if(count == 0)
    {
        ++count;
        past_ICtimer = IC2BUF;
        past_ICtimer = past_ICtimer << 16;
        past_ICtimer = past_ICtimer | IC1BUF;
    }
    else
    {
        present_ICtimer = IC2BUF;
        present_ICtimer = present_ICtimer << 16;
        present_ICtimer = present_ICtimer | IC1BUF;

        diff = present_ICtimer - past_ICtimer;
        if(diff < 30000)
        {
            ++count;
            if(count == 6)
            {
                WSAN_LED = 1;
                WSANFlags.bits.MicrowaveDetecting = 1;
            }

        }
        else
        {
            count = 0;
        }
    }
}
#endif

#if defined(USE_MQ6_V2)
void _ISR __attribute__((interrupt, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = CLEAR;
    if((WSANFlags.bits.OnTimeGetMQ6 != 0) && (WSANFlags.bits.DisableSendingMsg == 0))
    {
        //for(i = 0; i < 200; i++);//eliminate noise
        if(PORTFbits.RF6 == 0)
        {
            WSANFlags.bits.MQ6Warning = SET;
        }
    }
}
#endif


#if defined(USE_SHT10)
/*********************************************************************
 * Function:        void Send_HTE_ToRouterEmboard(WORD HTE_Cluster)
 *
 * PreCondition:
 *
 * Cluster:         HTE_RESPONSE_CLUSTER/HTE_AUTO_SEND_CLUSTER
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui du lieu nhiet do-do am-nang luong (HTE) ve
 *                  router-EMB.
 *
 * Note:
 ********************************************************************/

void Send_HTE_ToRouterEmboard(WORD HTE_Cluster)
{
    //cau truc ban tin du lieu dinh ki nhu sau:
    //D1D2D3D4D5D6D7D8EE
    //gui du lieu nhiet do - do am - nang luong chua qua xu ly
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0;
    TxBuffer[TxData++] = (BYTE) (temperature >> 8);
    TxBuffer[TxData++] = (BYTE) (temperature);
    TxBuffer[TxData++] = (BYTE) (humidity >> 8);
    TxBuffer[TxData++] = (BYTE) (humidity);
    #if defined(USE_WARNING_LOW_POWER)
        TxBuffer[TxData++] = (BYTE) (Energy_Level >> 8);
        TxBuffer[TxData++] = (BYTE) (Energy_Level);
    #else
        TxBuffer[TxData++] = 0x03;
        TxBuffer[TxData++] = 0xA3;
    #endif

    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;

    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

