win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = HTE_Cluster;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}

void LoadSHT10(void)
{
    BYTE error, checksum;

    error = 0;
    error += s_measure((BYTE*) &humidity, &checksum, HUMI); //measure humidity
    error += s_measure((BYTE*) &temperature, &checksum, TEMP); //measure temperature
    while (error != 0)
    {
        s_connectionreset(); //in case of an error: connection reset
        error += s_measure((BYTE*) &humidity, &checksum, HUMI); //measure humidity
        error += s_measure((BYTE*) &temperature, &checksum, TEMP); //measure temperature
    }
}
#endif

/*********************************************************************
 * Function:        void SendOnceByte(BYTE data, WORD ClusterID)
 *
 * PreCondition:    Init OK
 *
 * Input:           data, CluaterID
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui trang thai ve router-EMB. Cac trang thai co the
 *                  la tat/bat bom, chay rung, canh bao muc nang luong.
 *
 * Note:
 ********************************************************************/

void SendOneByte(BYTE data, WORD ClusterID)
{
    //cau truc ban tin gui tu router-emboard toi cac node khac: DD
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0;
    TxBuffer[TxData++] = data;

    //mode addressing
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;

    // Address of destination node
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;

    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;
    #endif

    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;

    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;
    params.APSDE_DATA_request.ClusterId.Val = ClusterID;

    //make ZigbeeIsReady() false
    ZigBeeBlockTx();

    currentPrimitive = APSDE_DATA_request;
}

#if defined (TRACE_ROUTE_SUPPORT)
/*********************************************************************
 * Function:        void RouteDrawRequestToNextHop(BYTE MSB_addr, BYTE LSB_addr, BYTE NodeNumber, BYTE *pListOfNode)
 *
 * PreCondition:
 *
 * Cluater:         REQUEST_ROUTE_CLUSTER
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui yeu cau ve tuyen den nut co dia chi mang MSB_addr, LSB_addr
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void RouteDrawRequestToNextHop(BYTE MSB_dest_addr, BYTE LSB_dest_addr, BYTE NodeNumber, BYTE *pListOfNode)
{
    BYTE i;
    NodeNumber ++;
    TxBuffer[TxData++] = MSB_dest_addr;//Dia chi Node dich
    TxBuffer[TxData++] = LSB_dest_addr;
    TxBuffer[TxData++] = NodeNumber;//So node di qua
    for (i = 0; i< NodeNumber - 1; i++) TxBuffer[TxData++]= *pListOfNode;
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0; //Chen them byte0 dia chi MAC cua node
    for (i = 0; i < ROUTING_TABLE_SIZE-RESERVED_ROUTING_TABLE_ENTRIES; i++ )//Gui den forward Node
    {
        GetRoutingEntry(&currentRoutingEntry,pCurrentRoutingEntry);
        if ((MSB_dest_addr == currentRoutingEntry.destAddress.byte.MSB)&&(LSB_dest_addr == currentRoutingEntry.destAddress.byte.LSB)&&(currentRoutingEntry.status == ROUTE_ACTIVE))
        {
            params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = currentRoutingEntry.nextHop.byte.MSB;
            params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = currentRoutingEntry.nextHop.byte.LSB;
            break;
        }
    }
       
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = ROUTE_DRAW_REQUEST_CLUSTER;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}
/*********************************************************************
 * Function:        void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode)
 *
 * PreCondition:
 *
 * Cluater:         REQUEST_ROUTE_CLUSTER
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui yeu cau ve tuyen den nut co dia chi mang MSB_addr, LSB_addr
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode)
{
    BYTE i;
    NodeNumber ++;
    TxBuffer[TxData++] = NodeNumber;//So node di qua
    for (i = 0; i< NodeNumber - 1; i++) TxBuffer[TxData++]= *pListOfNode;
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0; //Chen them byte0 dia chi MAC cua node
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

