win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRouter/Router.c
    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = ROUTE_DRAW_REPLY_CLUSTER;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}
#endif

/*********************************************************************
 * Function:        void MCUSleep(void)
 *
 * PreCondition:
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Put MCU into Sleep Mode
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void MCUSleep(void)
{
}
/*********************************************************************
 * Function:        void MCUSWake(void)
 *
 * PreCondition:
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Put MCU into Sleep Mode
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void MCUWake(void)
{
}
